
```

[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/bookie/bookie/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/bookie/bookie

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/wager/bookie/runs/run-yKH6ZaxpSY2yRCWu[0m
[0m
Waiting for the plan to start...

Terraform v1.1.3
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # github_actions_organization_secret.gcp_service_account_key[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "github_actions_organization_secret" "gcp_service_account_key" {
      [32m+[0m [0m[1m[0mcreated_at[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mplaintext_value[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msecret_name[0m[0m     = "GCP_SERVICE_ACCOUNT_KEY"
      [32m+[0m [0m[1m[0mupdated_at[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mvisibility[0m[0m      = "all"
    }

[1m  # google_service_account_key.github[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account_key" "github" {
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mkey_algorithm[0m[0m      = "KEY_ALG_RSA_2048"
      [32m+[0m [0m[1m[0mname[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprivate_key[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mprivate_key_type[0m[0m   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      [32m+[0m [0m[1m[0mpublic_key[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpublic_key_type[0m[0m    = "TYPE_X509_PEM_FILE"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = "projects/wager-233003/serviceAccounts/github@wager-233003.iam.gserviceaccount.com"
      [32m+[0m [0m[1m[0mvalid_after[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mvalid_before[0m[0m       = (known after apply)
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mgithub_codespaces_organization_secret[0m[0m = (sensitive value)

```
